Re10_testCase_including_Meshing_baseMeshSize0.33_15x10x10_slip_cylinder_newMesh/0.org/solidSphere/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField     uniform 400;

boundaryField
{
    solidSphere_to_fluid
    {
	  type		fixedValue;
	  value		uniform 400;
      
// 	  type           	compressible::turbulentTemperatureCoupledBaffleMixed;
// 	  value           	uniform 400;
// 	  Tnbr 			T;
// 	  kappa           	solidThermo;
// 	  kappaName       	none;
    }
}

// ************************************************************************* //
