Re10_testCase_including_Meshing_baseMeshSize0.33_15x10x10_slip_cylinder_newMesh/system/fluid/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme 	cell;

setFormat       	raw;

surfaceFormat 		vtk;

surfaces
(
      sphereSurface
      {
	    type		patch;
	    patches		("fluid_to_solidSphere");
	    interpolate		true;
	    triangulate		false;
      }
);

fields          ( p );


// ************************************************************************* //
