Re10_testCase_including_Meshing_baseMeshSize0.33_15x10x10_slip_cylinder_newMesh/system/functionObjects/probesSolid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    probesSolid
    {
        functionObjectLibs 	( "libsampling.so" );
        type            	probes;
        name            	probes;
        outputControl   	timeStep;
	outputInterval  	2;
	region			solidSphere;
	
        fields
        (
            T
        );
	
        probeLocations
        (
            ( 0.001 0.001  0.48 )    
            ( 0.001 0.001  0 )
	    ( 0.001 0.001 -0.48 )  
        );
    }

// ************************************************************************* //
