Re10_testCase_including_Meshing_baseMeshSize0.33_15x10x10_slip_cylinder_newMesh/system/functionObjects/slicesFluid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

    slicesFluid
    {
          type 			surfaces;
          functionObjectLibs 	("libsampling.so");
          interpolationScheme 	cell;
	  outputControl   	outputTime;
          surfaceFormat 	vtk;
	  region 		fluid;

          fields ( U p T );

          surfaces
          (
              xyPlane
              {
                  type 			cuttingPlane;
                  planeType 		pointAndNormal;
                  pointAndNormalDict
                  {
                      basePoint 	(0 0 0);
                      normalVector 	(0 0 1);
                  }
		  interpolate true;
              }
              
              xzPlane
              {
                  type 			cuttingPlane;
                  planeType 		pointAndNormal;
                  pointAndNormalDict
                  {
                      basePoint 	(0 0 0);
                      normalVector 	(0 1 0);
                  }
		  interpolate true;
              }
              
              yzPlane
              {
                  type 			cuttingPlane;
                  planeType 		pointAndNormal;
                  pointAndNormalDict
                  {
                      basePoint 	(0 0 0);
                      normalVector 	(1 0 0);
                  }
		  interpolate true;
              }
  	   );
        }

// ************************************************************************* //
